In [2]:
import pandas as pd
import numpy as np

In [3]:
#*************************************************Series**************************************************

In [4]:
#series 和array很像，不过series 有labels, array只有index

In [5]:
labels=('a','b','c')
my_data=[10,20,30]
arr=np.array(my_data)
d={'a':10,'b':20,'c':30}

In [6]:
#我们通常处理的就是这种非常简单，一目了然的数据
#比如这里my_data只有一行而已，但是我们即将碰到的数据是一个表格，有很多行和列，甚至数据量都很大，所以要知道你现在其实是在处理什么？
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [7]:
#specify the labels
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(d)  #如果放入一个dictionary 。就会自动转化成labels and data

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [11]:
pd.Series([1,2,3,4],['USA','Germany','Italy','Japan'])

USA        1
Germany    2
Italy      3
Japan      4
dtype: int64

In [12]:
s1=pd.Series([1,2,3,4],['USA','Germany','Italy','Japan'])
s2=pd.Series([1,2,3,4],['USA','Germany','Italy','Japan'])
s1+s2

USA        2
Germany    4
Italy      6
Japan      8
dtype: int64

In [ ]:
#************************************************DataFrame******************************************************

In [36]:
import numpy as np
import pandas as pd

In [37]:
from numpy.random import randn

In [38]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [39]:
df

          W         X         Y         Z
A -0.258105  0.615544  1.525633  0.129617
B  1.291357 -0.941583  1.145258 -0.578191
C  0.667296  0.929932 -0.053633  1.418267
D  0.653691  1.300254 -1.809763  0.648385
E -0.950936 -0.308833 -0.094851 -2.506911

In [40]:
df['W']

A   -0.258105
B    1.291357
C    0.667296
D    0.653691
E   -0.950936
Name: W, dtype: float64

In [41]:
df[['W','Z']]  #pass in a list

          W         Z
A -0.258105  0.129617
B  1.291357 -0.578191
C  0.667296  1.418267
D  0.653691  0.648385
E -0.950936 -2.506911

In [42]:
df['new']=df['W']+df['Y']
df

          W         X         Y         Z       new
A -0.258105  0.615544  1.525633  0.129617  1.267528
B  1.291357 -0.941583  1.145258 -0.578191  2.436615
C  0.667296  0.929932 -0.053633  1.418267  0.613663
D  0.653691  1.300254 -1.809763  0.648385 -1.156072
E -0.950936 -0.308833 -0.094851 -2.506911 -1.045787

In [43]:
df.drop('new',axis=1) #axis=1 means to drop columns

          W         X         Y         Z
A -0.258105  0.615544  1.525633  0.129617
B  1.291357 -0.941583  1.145258 -0.578191
C  0.667296  0.929932 -0.053633  1.418267
D  0.653691  1.300254 -1.809763  0.648385
E -0.950936 -0.308833 -0.094851 -2.506911

In [44]:
df.drop('E')

          W         X         Y         Z       new
A -0.258105  0.615544  1.525633  0.129617  1.267528
B  1.291357 -0.941583  1.145258 -0.578191  2.436615
C  0.667296  0.929932 -0.053633  1.418267  0.613663
D  0.653691  1.300254 -1.809763  0.648385 -1.156072

In [45]:
df.shape #因为行在tuple里面的index是0，所以axis=0表示行

(5, 5)

In [ ]:
#Rows

In [46]:
df.loc['A']  #label

W     -0.258105
X      0.615544
Y      1.525633
Z      0.129617
new    1.267528
Name: A, dtype: float64

In [47]:
df.iloc[2]  #index

W      0.667296
X      0.929932
Y     -0.053633
Z      1.418267
new    0.613663
Name: C, dtype: float64

In [50]:
df.loc['B','Y']  #row and column

1.1452582266514995

In [51]:
df.loc[['A','B'],['W','Z']]

          W         Z
A -0.258105  0.129617
B  1.291357 -0.578191

In [ ]:
#～～～～～～～～～～～～～～～～～～·Conditional Selection～～～～～～～～～～～～～～～～～～

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
np.random.seed(101)

In [ ]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [52]:
df>0

       W      X      Y      Z    new
A  False   True   True   True   True
B   True  False   True  False   True
C   True   True  False   True   True
D   True   True  False   True  False
E  False  False  False  False  False

In [53]:
bool_df=df>0
df[bool_df]

          W         X         Y         Z       new
A       NaN  0.615544  1.525633  0.129617  1.267528
B  1.291357       NaN  1.145258       NaN  2.436615
C  0.667296  0.929932       NaN  1.418267  0.613663
D  0.653691  1.300254       NaN  0.648385       NaN
E       NaN       NaN       NaN       NaN       NaN

In [54]:
df[df>0]

          W         X         Y         Z       new
A       NaN  0.615544  1.525633  0.129617  1.267528
B  1.291357       NaN  1.145258       NaN  2.436615
C  0.667296  0.929932       NaN  1.418267  0.613663
D  0.653691  1.300254       NaN  0.648385       NaN
E       NaN       NaN       NaN       NaN       NaN

In [55]:
df['W']>0

A    False
B     True
C     True
D     True
E    False
Name: W, dtype: bool

In [56]:
df[df['W']>0]  #we will get all the rows that are true ,返回的还是一个df

          W         X         Y         Z       new
B  1.291357 -0.941583  1.145258 -0.578191  2.436615
C  0.667296  0.929932 -0.053633  1.418267  0.613663
D  0.653691  1.300254 -1.809763  0.648385 -1.156072

In [60]:
result_df=df[df['W']>0]
result_df['X']

B   -0.941583
C    0.929932
D    1.300254
Name: X, dtype: float64

In [61]:
df[df['W']>0]['X']

B   -0.941583
C    0.929932
D    1.300254
Name: X, dtype: float64

In [63]:
df[df['W']>0][['Y','X']]  #这样会改变顺序的哦

          Y         X
B  1.145258 -0.941583
C -0.053633  0.929932
D -1.809763  1.300254

In [ ]:
#~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~multiple condition selection~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

In [67]:
'''注意这里不能用and，因为在python中 and 只能判断单个的bool值，比如True and True is True'''
df[(df['W']>0)&(df['Y']>1)]

          W         X         Y         Z       new
B  1.291357 -0.941583  1.145258 -0.578191  2.436615

In [66]:
df[(df['W']>0)|(df['Y']>1)]

          W         X         Y         Z       new
A -0.258105  0.615544  1.525633  0.129617  1.267528
B  1.291357 -0.941583  1.145258 -0.578191  2.436615
C  0.667296  0.929932 -0.053633  1.418267  0.613663
D  0.653691  1.300254 -1.809763  0.648385 -1.156072

In [68]:
df.reset_index()

  index         W         X         Y         Z       new
0     A -0.258105  0.615544  1.525633  0.129617  1.267528
1     B  1.291357 -0.941583  1.145258 -0.578191  2.436615
2     C  0.667296  0.929932 -0.053633  1.418267  0.613663
3     D  0.653691  1.300254 -1.809763  0.648385 -1.156072
4     E -0.950936 -0.308833 -0.094851 -2.506911 -1.045787

In [69]:
new_index='CA NY WY OR CO'.split()
new_index

['CA', 'NY', 'WY', 'OR', 'CO']

In [70]:
df['States']=new_index
df

          W         X         Y         Z       new States
A -0.258105  0.615544  1.525633  0.129617  1.267528     CA
B  1.291357 -0.941583  1.145258 -0.578191  2.436615     NY
C  0.667296  0.929932 -0.053633  1.418267  0.613663     WY
D  0.653691  1.300254 -1.809763  0.648385 -1.156072     OR
E -0.950936 -0.308833 -0.094851 -2.506911 -1.045787     CO

In [71]:
df.set_index('States')

               W         X         Y         Z       new
States
CA     -0.258105  0.615544  1.525633  0.129617  1.267528
NY      1.291357 -0.941583  1.145258 -0.578191  2.436615
WY      0.667296  0.929932 -0.053633  1.418267  0.613663
OR      0.653691  1.300254 -1.809763  0.648385 -1.156072
CO     -0.950936 -0.308833 -0.094851 -2.506911 -1.045787

In [ ]:
# index levels
import pandas as pd
import numpy as np
outside=['G1','G1','G1','G2','G2','G2']
inside=['1','1','1','2','2','2']
hier_index=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [ ]:
hier_index

In [ ]:
df=pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [ ]:
df

In [ ]:
#对于multiIndex 的取值也是用loc
df.loc['G1']

In [ ]:
#然后因为取出来的也是一个DataFrame，所以还是用loc方法进行进一步的取值
df.loc['G1'].loc[1]

In [ ]:
#给index命名
df.index.names  #会发现是一个list,里面的元素是None

In [ ]:
#这个list原来就是存在的，现在把它改成gruops and numbers 
df.index.names = ['Groups','Numbers']

In [ ]:
#~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~cross section~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

In [ ]:
df.xs('G1')

In [ ]:
#eg. grab index 1 in both groups

In [ ]:
df.xs(1,level='Numbers')

In [ ]:
help(df.xs)

In [ ]:
#～～～～～～～～～～～～～～～～～～Missing Data～～～～～～～～～～～～～～～～～～

In [4]:
import pandas as pd
import numpy as np

In [5]:
d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [6]:
df=pd.DataFrame(d)

In [7]:
#1. dropna()
dropna(axis=1)  #drop all columns with na value, and return the columns that don't have any NaNs

NameError: name 'dropna' is not defined

In [ ]:
#那么可以知道如果不指定axis=1的话就是默认为0
dropna()

In [ ]:
#thresh，给一个阀值，比如=2，那就是只扔掉有2个na的东西

In [8]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [9]:
#2. df.fillna
df.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [10]:
#还有一个骚操作是填充改列的均值
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [ ]:
#~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~Groupby~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

In [ ]:
#就是Excel中的分组，需要有一个aggregate function

In [13]:
import pandas as pd
import numpy as np

In [24]:
d={'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
   'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
   'Sales':[200,120,340,124,243,350]}
df=pd.DataFrame(d)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [25]:
df.groupby('Company')

In [26]:
bycom=df.groupby('Company')  #这里的GOOG, FB,MSFT等就相当于变成index了

In [27]:
bycom

In [28]:
bycom.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [29]:
bycom.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [ ]:
#这才是真正处理DataFrame的方式

In [30]:
bycom.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [36]:
type(bycom.std())

pandas.core.frame.DataFrame

In [37]:
#返回的也是一个DataFrame，所以可以用前面学过的indexing方式来取值
bycom.mean().loc['FB']

Sales    296.5
Name: FB, dtype: float64

In [38]:
bycom.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [40]:
bycom.count() #下面有几个值

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [41]:
bycom.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [42]:
bycom.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [43]:
bycom.describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [ ]:
#~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~Merging,joining and concatenating~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

In [ ]:
#这是处理不同的DataFrame的操作了
import pandas as pd
import numpy as np

In [49]:
df1=pd.DataFrame({'A':['A0','A1','A2','A3'],
                  'B':['B0','B1','B2','B3'],
                  'C':['C0','C1','C2','C3'],
                  'D':['D0','D1','D2','D3']},
                index=[0,1,2,3])
df2=pd.DataFrame({'A':['A4','A5','A6','A7'],
                  'B':['B4','B5','B6','B7'],
                  'C':['C4','C5','C6','C7'],
                  'D':['D4','D5','D6','D7']},
                index=[4,5,6,7])
df3=pd.DataFrame({'A':['A8','A9','A10','A11'],
                  'B':['B8','B9','B10','B11'],
                  'C':['C8','C9','C10','C11'],
                  'D':['D8','D9','D10','D11']},
                index=[8,9,10,11])

In [50]:
#看这样子就是要根据列来concatenate
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [ ]:
#~~~~~~~~~~~~~~~~~~~Merging~~~~~~~~~~~~~~~~~~~

In [ ]:
#这里的逻辑和SQL很相似

In [53]:
left=pd.DataFrame({'key':['K0','K1','K2','K3'],
                  'A':['A0','A1','A2','A3'],
                  'B':['B0','B1','B2','B3']})

right=pd.DataFrame({'key':['K0','K1','K2','K3'],
                  'C':['C8','C9','C10','C11'],
                  'D':['D8','D9','D10','D11']})

In [54]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [ ]:
right

In [ ]:
#这个意思就是说如果有1列在两个df中是一样的话，就可以合并
pd.merge(left,right,how='inner',on='key')

In [ ]:
#也可以merge 更多columns
left=pd.DataFrame({'key1':['K0','K1','K2','K3'],
                   'key2':['k0','k1','k0','k1']
                  'A':['A0','A1','A2','A3'],
                  'B':['B0','B1','B2','B3']})

right=pd.DataFrame({'key1':['K0','K1','K2','K3'],
                    'key2':['k0','k1','k0','k1']
                  'C':['C8','C9','C10','C11'],
                  'D':['D8','D9','D10','D11']})

In [ ]:
pd.merge(left,right,on=['key1','key2'])

In [ ]:
#joining is used to combing the columns of two potentially differently-indexed DataFrames into a single DataFrame

In [ ]:
left=pd.DataFrame({'A':['A0','A1','A2','A3'],
                  'B':['B0','B1','B2','B3']},
                 index=['K0','K1','K2'])
right=pd.DataFrame({'A':['A0','A1','A2','A3'],
                  'B':['B0','B1','B2','B3']},
                 index=['K0','K2','K3'])

In [ ]:
left.join(right)

In [ ]:
left.join(right,how='outer')

In [ ]:
#************************************************Operations***********************************************

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
df=pd.DataFrame({'col1':[1,2,3,4]},
               'col2':[444,555,666,444],
               'col3':['abc','def','ghi','xyz'])

In [ ]:
#1.unique()
df['col2'].unique()

In [ ]:
len(df['col2'].unique())
#这个方法相当于nunique()

In [ ]:
df['col2'].nunique()

In [ ]:
#2. value_counts()
df['col2'].value_counts()

In [ ]:
#3. apply()
df['col1']

In [ ]:
def times2(x):
    return x**2
df['col1'].apply(times2)

In [ ]:
df['col1'].apply(lambda x:x**2)

In [ ]:
df['col3'].apply(len)

In [ ]:
dir(df)